<?php
/**
 * Created by PhpStorm.
 * User: JHR
 * Date: 2018/9/18
 * Time: 19:56
 */
return [
        '-3' => '非法参数',
        '-2' => '数据不能为空',
        '-1' => '操作失败',
        '1' => '操作成功',
        '2' => '登录失败',
        '3' => '无效的token',
        '4' => '授权失败',
        '5' => '无效的金额',
        '6' => '无效的经纬度',
        '7' => '无效的人数',
        '8' => '无效的时间',
        '9' => '上传图片失败',
        '10' => '订单不存在',
        '11' => '不可重复申请',
        '12' => '此地区未开通',
        '13' => '身份证号不合法',
        '14' => '手机号不合法',
        '15' => '字数超出限制',
        '16' => '请先授权',
        '17' => '当前状态无法认证',
        '18' => '您的信誉太低',
        '19' => '已进入黑名单',
        '20' => '用户未认证',
        '21' => '订单不存在',
        '22' => '这是自己发的单',
        '23' => '分享人ID不存在',
        '' => '',
        '' => '',
        '' => '',
        '' => '',
        '' => '',
        '' => '',
        '' => '',
        '' => '',
        '' => '',
        '' => '',
        '' => '',
        '' => '',
        '' => '',
];